#CAPSTONE PROJECT

This project is based on Edtech - College tuition, diversity and pay.

Creating the environment.

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///test_db

Creating and populating the tables.

In [3]:
%%sql CREATE TABLE university_details(
    id_number INT,
    university_name VARCHAR(40),
    state VARCHAR(40),
    PRIMARY KEY(id_number)
);

 * sqlite:///test_db
Done.

[]

In [4]:
%%sql INSERT INTO university_details (id_number, university_name, state) ValueS
(011, 'Aaniiih Nakoda College', 'Montana'),
(012, 'Abilene Christian University', 'Texas'),
(013, 'Abraham Baldwin Agricultural College','Georgia'),
(014, 'Academy College','Minnesota'),
(015, 'Academy of Art University', 'California'),
(016, 'Adams State University', 'Colorado');

 * sqlite:///test_db
6 rows affected.

[]

In [5]:
%%sql CREATE TABLE tuition_cost(
    id_number INT,
    state_code VARCHAR (30),
    type VARCHAR (40),
    degree_length VARCHAR (10),
    room_and_board DOUBLE,
    in_state_tuition DOUBLE,
    in_state_total DOUBLE,
    out_of_state_tuition DOUBLE,
    out_of_state_total DOUBLE,
    PRIMARY KEY(id_number),
    FOREIGN KEY (id_number) REFERENCES university_details(id_number)

);

 * sqlite:///test_db
Done.

[]

In [6]:
%%sql INSERT INTO tuition_cost (id_number, state_code, type, degree_length, room_and_board, in_state_tuition, in_state_total, out_of_state_tuition, out_of_state_total)
VALUES
    (1, 'MT', 'Public', 2, NULL, 2380, 2380, 2380, 2380),
    (2, 'TX', 'Private', 4, 10350, 34850, 45200, 34850, 45200),
    (3, 'GA', 'Public', 2, 8474, 4128, 12602, 12550, 21024),
    (4, 'MN', 'For Profit', 2, NULL, 17661, 17661, 17661, 17661),
    (5, 'CA', 'For Profit', 4, 16648, 27810, 44458, 27810, 44458),
    (6, 'CO', 'Public', 4, 8782, 9440, 18222, 20456, 29238),
    (7, 'NY', 'Private', 4, 16030, 38660, 54690, 38660, 54690),
    (8, 'NY', 'Public', 2, 11660, 5375, 17035, 9935, 21595),
    (9, 'MI', 'Private', 4, 11318, 37087, 48405, 37087, 48405),
    (10, 'VA', 'For Profit', 2, NULL, 13680, 13680, 13680, 13680);

 * sqlite:///test_db
10 rows affected.

[]

In [7]:
%%sql CREATE TABLE tuition_income(
    id_number INT,
    total_price DOUBLE,
    year DOUBLE,
    campus VARCHAR (40),
    net_cost DOUBLE,
    income_lvl VARCHAR (30),
    PRIMARY KEY(id_number,year),
     FOREIGN KEY (id_number) REFERENCES university_details(id_number)
);

 * sqlite:///test_db
Done.

[]

In [8]:
%%sql INSERT INTO tuition_income (id_number, total_price, year, campus, net_cost, income_lvl) VALUES
    (001, 20174, 2016, 'On Campus', 11475, '0 to 30,000'),
    (002, 22413, 2017, 'Off Campus', 0, '0 to 30,000'),
    (003, 39475, 2017, 'Off Campus', 0, '0 to 30,000'),
    (004, 14622, 2016, 'Off Campus', 2271, '0 to 30,000'),
    (005, 20830, 2018, 'Off Campus', 0, 'Over 110,000');

 * sqlite:///test_db
5 rows affected.

[]

In [9]:
%%sql CREATE TABLE salary_potential(
    id_number INT,
    rank DOUBLE,
    early_career_pay DOUBLE,
    mid_career_pay DOUBLE,
    make_world_better_percent DOUBLE,
    stem_percent DOUBLE,
    PRIMARY KEY(id_number),
    FOREIGN KEY (id_number) REFERENCES university_details(id_number)
);

 * sqlite:///test_db
Done.

[]

In [10]:
%%sql INSERT INTO salary_potential (id_number, rank, early_career_pay, mid_career_pay, make_world_better_percent, stem_percent)
VALUES
    (011, 1, 54400, 104500, 51, 31),
    (012, 2, 57500, 103900, 59, 45),
    (013, 3, 52300, 97400, 50, 15),
    (014, 4, 54500, 93500, 61, 30),
    (015, 5, 48400, 90500, 52, 3),
    (016, 6, 46600, 89100, 53, 12),
    (017, 7, 49100, 88300, 48, 27),
    (018, 8, 48600, 87200, 57, 17);

 * sqlite:///test_db
8 rows affected.

[]

In [11]:
%%sql CREATE TABLE historical_tuition(
    type VARCHAR (40),
    year VARCHAR (30),
    tuition_type VARCHAR (30),
    tuition_cost DOUBLE,
    PRIMARY KEY(type,year),
     FOREIGN KEY (type) REFERENCES tuition_cost(type)
);

 * sqlite:///test_db
Done.

[]

In [12]:
%%sql INSERT INTO historical_tuition (type, year, tuition_type, tuition_cost) VALUES
('All Institutions','1985-86','All Constant',10893),
('Public','1985-86','All Constant',7964),
('Private','1985-86','All Constant',19812);

 * sqlite:///test_db
3 rows affected.

[]

In [13]:
%%sql CREATE TABLE diversity_school(
    total_enrollment DOUBLE,
    id_number INT,
    category VARCHAR(25),
    enrollment DOUBLE,
    PRIMARY KEY(id_number,category),
    FOREIGN KEY (id_number) REFERENCES university_details(id_number)
);

 * sqlite:///test_db
Done.

[]

In [17]:
%%sql INSERT INTO diversity_school (total_enrollment, id_number, category, enrollment) VALUES
(195059, 1, 'Women', 134722),
(91179, 2, 'Women', 53476),
(81459, 3, 'Asian', 856),
(69395, 4, 'Black', 12094),
(66046, 5, 'Hispanic', 44870);

 * sqlite:///test_db
5 rows affected.

[]